Repository: sigmdel/lazmqttc
Catalog: languages/lazmqttc.*.po
Languages: fr

source: Error reading options.json: %s
fr: Erreur en lecture de options.json : %s

source: Delete <%s>
fr: Éliminer <%s>

source: Close without saving changes
fr: Fermer sans sauvegarder les modifications

source: Connected
fr: Connecté

source: Attempting to connect
fr: Connexion en cours

source: Disconnected
fr: Déconnecté

source: No MQTT Client
fr: Pas de client MQTT

source: Attempting to reconnect
fr: Reconnexion en cours

source: All files
fr: Tous les fichiers

source: Connect
fr: Connecter

# stringres.sdisconnect
source: Disconnect
fr: Déconnecter

source: false
fr: faux

source: JSON files
fr: Fichers JSON

source: Message not published
fr: Message non publié

source: Message published
fr: Message publié

source: MQTT Error: %d
fr: Erreur MQTT : %d

source: The MQTT client has not been created
fr: Le client MQTT n'a pas été crée

source: Password encryption key is empty - program halted
fr: Programme arrêter car la clé de chiffrement du mot de passe est vide

source: OK but the message had no payload
fr: OK, mais le message était vide

source: The MQTT client is not connected
fr: Le client MQTT n'est pas connecté

source: A topic must be specified
fr: Un sujet doit être défini

source: Broker Security Encryption Publish Topic Subscribe Topics
fr: Serveur MQTT Sécurité Chiffrement Sujet à publier Sujets à souscrire

source: Quality of Service
fr: Qualité du service

source: 0 - At most once 1 - At least once 2 - Exactly once
fr: 0 - Au plus un envoi 1 - Au moins un envoi 2 - Exactement un envoi

source: QoS
fr: QdS

source: Retain flag removed for topic %s
fr: Le sujet %s ne sera plus conservé

source: Subscribe Topics
fr: Sujets souscrits

# stringres.stopictitle
source: Topic
fr: Sujet

source: true
fr: vrai

# stringres.susetitle
source: Use
fr: Act.

# tbrokereditform.acceptbutton.caption
source: &Accept
fr: &Valider

source: Add new topic
fr: Ajouter un sujet

source: Delete all topics
fr: Éliminer tous les sujets

source: Delete the selected topic
fr: Éliminer le sujet sélectionné

source: Edit the selected topic
fr: Modifier le suset sélectionné

source: (true)
fr: (vrai)

# tbrokereditform.cancelbutton.caption
source: &Cancel
fr: &Annuler

# tbrokereditform.caption
source: MQTT Broker Editor
fr: Editeur du serveur MQTT

source: Keep Alive Interval
fr: Intervalle de maintien en vie

source: Automatic Reconnect
fr: Reconnexion automatique

# tbrokereditform.label11.caption
source: Topic
fr: Sujet

source: Quality of Service (QoS)
fr: Qualité du service (QdS)

# tbrokereditform.label13.caption
source: Retain
fr: Conserver

# tbrokereditform.label14.caption
source: Payload
fr: Contenu

source: MQTT Client ID (optional)
fr: Identifiant du client (optionnel)

source: Host
fr: Hôte

source: Reconnect Delay
fr: Délai de reconnexion

source: Reconnect Backoff
fr: Ralentissement des reconnexions

source: User:
fr: Utilisateur

source: Password:
fr: Mot de passe

source: Enable SSL
fr: SSL activé

source: SSL Certificate
fr: Certificat SSL

# tbrokereditform.loadbutton.caption
source: &Load...
fr: &Charger...

source: Default MQTT Port: 1883
fr: Port MQTT par défaut : 1883

# tbrokereditform.pubretaincheckbox.caption
source: (false)
fr: (faux)

# tbrokereditform.reconnectbackoffcheckbox.caption
source: (false)
fr: (faux)

# tbrokereditform.savebutton.caption
source: &Save...
fr: &Sauvegarder...

source: Accept
fr: Accepter

source: Cancel
fr: Annuler

source: Subscribe Topic Editor
fr: Editeur des messages souscris

source: Topic:
fr: Sujet

source: Quality of Service (QoS):
fr: Qualité du service (QdS)

# teditsubtopicform.label3.caption
source: Use
fr: Act.

source: (subscribe to this topic)
fr: (se souscrire à ce sujet)

source: &Close
fr: &Exit

source: &No
fr: &Non

source: &Yes
fr: &Oui

source: Auto clear
fr: Auto effacement

source: MQTT Client
fr: Client MQTT

# tmainform.connectbutton.caption
source: Disconnect
fr: Déconnecter

source: Show
fr: Montrer

source: Copy the message in the Messages window
fr: Copier dans Messages

source: Edit
fr: Modifier

source: Broker:
fr: Agent :

# tmainform.label3.caption
source: Topic
fr: Sujet

# tmainform.label4.caption
source: Payload
fr: Contenu

source: Quality of service (QoS)
fr: Qualité du service (QdS)

# tmainform.label6.caption
source: Retain
fr: Conserver

# tmainform.logmenuclearmenuitem.caption
source: Clear
fr: Effacer

# tmainform.logmenucopymenuitem.caption
source: Copy all
fr: Copier tout

# tmainform.logmenucopyselectionmenuitem.caption
source: Copy selection
fr: Copier la sélection

source: subscribe
fr: souscription

source: unsubscribe
fr: désabonnement

source: Log Level:
fr: Niveaux de journal :

source: notice
fr: note

source: warning
fr: avertissement

source: error
fr: erreur

source: debug
fr: débogage

# tmainform.messagemenuwordwrapmenuitem.caption
source: Word wrap
fr: Retour automatique à la ligne

# tmainform.messagesmenuclearmenuitem.caption
source: Clear
fr: Effacer

# tmainform.messagesmenucopymenuitem.caption
source: Copy all
fr: Copier tout

# tmainform.messagesmenucopyselectionmenuitem.caption
source: Copy selection
fr: Copier la sélection

# tmainform.optionsbutton.caption
source: Options
fr: Paramètres

source: Publish
fr: Publier

source: Quit
fr: Exit

# tmainform.retaincheckbox.caption
source: (false)
fr: (faux)

# tmainform.showtopicscheckbox.caption
source: Show topics
fr: Montrer les sujets

source: Log
fr: Journal

# toptionseditform.acceptbutton.caption
source: &Accept
fr: &Valider

# toptionseditform.autoclearcheckbox.caption
source: Auto clear previous messages on publishing a message
fr: Effacer anciens messages sur publication d'un message

# toptionseditform.autoconnectcheckbox.caption
source: Enabled
fr: Activé

# toptionseditform.cancelbutton.caption
source: &Cancel
fr: &Annuler

# toptionseditform.caption
source: Options Editor
fr: Paramètres

source: Delay waiting for connection (seconds)
fr: Délais en attente de la connexion (secondes)

source: Published message header
fr: Préfixe des messages publiés

source: Received message header
fr: Préfixe des messages reçus

source: Maximum number of logged messages
fr: Nombre maximum de messages affichés

source: Automatic connection to the broker on publishing a message
fr: Connexion automatique au serveur à l'envoi d'un message

source: Default broker
fr: Serveur initial

# toptionseditform.resetbutton.caption
source: &Reset
fr: &Réinitialiser

source: Show published messages
fr: Montrer les messages publiés

source: Show message topics
fr: Montrer les sujets des messages
